Tekla Open API Reference for Tekla Structures 2025
PolycurveGeometryBuilder.AppendSegment Method
 Appends an line segment. The first point is taken as the last point of the last element of the polycurve.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolycurveGeometryBuilder AppendSegment(
	Point endPoint
)
Public Function AppendSegment (
	endPoint As Point
) As PolycurveGeometryBuilder
Parameters
endPoint
Type: Tekla.Structures.Geometry3d.Point
Segment end point
Return Value
Type: PolycurveGeometryBuilder
The builder itself
Remarks
 This function requires that there is at least one curve in the polycurve
See Also
Reference
PolycurveGeometryBuilder Class
Tekla.Structures.Geometry3d Namespace